# Books(Core) Project

**Brittany Lassiter**

## Books ERD

 ![png](Data/bookcore.png)

## Imports/Data

In [1]:
import pandas as pd
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open ("C:/Users/blass/.secret/mysql.json") as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/Books"
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

## Show Tables

In [5]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Empty tables

In [6]:
q= '''SELECT * FROM authors'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, author_name]
Index: []

In [7]:
q= '''SELECT * FROM books'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, title, author_id]
Index: []

In [8]:
q= '''SELECT * FROM favorites'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [book_id, user_id]
Index: []

In [9]:
q= '''SELECT * FROM users'''
pd.read_sql(q, engine)

Empty DataFrame
Columns: [id, first_name, last_name, email]
Index: []

## Import Data

In [10]:
df = pd.read_csv('Data/Customers_favorite_books - Customers_favorite_books.csv')
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   First Name   7 non-null      object
 1   Last Name    7 non-null      object
 2   Email        7 non-null      object
 3   Book Title   7 non-null      object
 4   Book Author  7 non-null      object
dtypes: object(5)
memory usage: 408.0+ bytes

,First Name,Last Name,Email,Book Title,Book Author
0,John,Doe,JD@books.com,The Shining,Stephen King
1,John,Doe,JD@books.com,It,Stephen King
2,John,Doe,JD@books.com,The Great Gatsby,F. Scott Fitzgerald
3,Robin,Smith,Robin@books.com,The Call of the Wild,Jack London
4,Robin,Smith,Robin@books.com,Pride and Prejudice,Jane Austen

In [11]:
users = pd.read_csv('Data/users  - users.csv')
users.info()
users.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          3 non-null      int64
 1   first_name  3 non-null      object
 2   last_name   3 non-null      object
 3   email       3 non-null      object
dtypes: int64(1), object(3)
memory usage: 224.0+ bytes

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [12]:
books = pd.read_csv('Data/books - books.csv')
books.info()
books.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   id         6 non-null      int64
 1   title      6 non-null      object
 2   author_id  6 non-null      int64
dtypes: int64(2), object(1)
memory usage: 272.0+ bytes

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [13]:
authors = pd.read_csv('Data/authors - authors.csv')
authors.info()
authors.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   id           5 non-null      int64
 1   author_name  5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [14]:
favorites = pd.read_csv('Data/favorites - favorites.csv')
favorites.info()
favorites.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   user_id  7 non-null      int64
 1   book_id  7 non-null      int64
dtypes: int64(2)
memory usage: 240.0 bytes

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

## Foreign Keys

In [15]:
# Checking the setting for FOREIGN_KEY_CHECKS
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q, engine)

   @@FOREIGN_KEY_CHECKS
0                     1

In [16]:
# Changing the setting for FOREIGN_KEY_CHECKS with the connection
q = """SET @@FOREIGN_KEY_CHECKS=0"""
engine.execute(q)

In [17]:
# Confirm the checks are deactiavated
q = """SELECT @@FOREIGN_KEY_CHECKS"""
pd.read_sql(q,engine)

   @@FOREIGN_KEY_CHECKS
0                     0

## Describe

### Author

In [18]:
q = '''DESCRIBE authors;'''
describe = pd.read_sql(q, engine)
describe

         Field         Type Null  Key Default Extra
0           id          int   NO  PRI    None
1  author_name  varchar(45)  YES         None

In [19]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [20]:
# Checking dataframe's columns
authors.columns

Index(['id', 'author_name'], dtype='object')

In [21]:
# Reviewing SQL table's data types
describe[['Field','Type']]

         Field         Type
0           id          int
1  author_name  varchar(45)

In [22]:
# Reviewing dataframe's data types
authors.dtypes

id              int64
author_name    object
dtype: object

In [23]:
authors.to_sql("authors",engine,index=False, if_exists='append')

5

In [24]:
# confirm the data has been added
q = """SELECT * FROM authors;"""
pd.read_sql(q,engine)

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

### Books

In [25]:
q = '''DESCRIBE books'''
pd.read_sql(q, engine)

       Field         Type Null  Key Default Extra
0         id          int   NO  PRI    None
1      title  varchar(45)  YES         None
2  author_id          int   NO  MUL    None

In [26]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [27]:
# Checking dataframe's columns
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [28]:
# Reviewing SQL table's data types
describe[['Field','Type']]

         Field         Type
0           id          int
1  author_name  varchar(45)

In [29]:
# Reviewing dataframe's data types
books.dtypes

id            int64
title        object
author_id     int64
dtype: object

In [30]:
books.to_sql("books",engine,index=False, if_exists='append')

6

### Favrites

In [31]:
q= '''DESCRIBE favorites'''
pd.read_sql(q, engine)

     Field Type Null  Key Default Extra
0  book_id  int   NO  PRI    None
1  user_id  int   NO  PRI    None

In [32]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [33]:
# Checking dataframe's columns
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [34]:
# Reviewing SQL table's data types
describe[['Field','Type']]

         Field         Type
0           id          int
1  author_name  varchar(45)

In [35]:
# Reviewing dataframe's data types
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

In [36]:
favorites.to_sql("favorites",engine,index=False, if_exists='append')

7

### Users

In [37]:
q= '''DESCRIBE users'''
pd.read_sql(q, engine)

        Field         Type Null  Key Default Extra
0          id          int   NO  PRI    None
1  first_name  varchar(45)  YES         None
2   last_name  varchar(45)  YES         None
3       email  varchar(45)  YES         None

In [38]:
# Checking describe's Field names
describe['Field'].values

array(['id', 'author_name'], dtype=object)

In [39]:
# Checking dataframe's columns
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [40]:
# Reviewing SQL table's data types
describe[['Field','Type']]

         Field         Type
0           id          int
1  author_name  varchar(45)

In [41]:
# Reviewing dataframe's data types
users.dtypes

id             int64
first_name    object
last_name     object
email         object
dtype: object

In [42]:
users.to_sql("users",engine,index=False, if_exists='append')

3

## Showing tables

In [43]:
# Preview the names of all tables 
q = '''SHOW TABLES;'''
pd.read_sql(q, engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Testing Database

In [44]:
q = '''
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.id FROM users WHERE (users.last_name = "Doe" AND users.first_name = "John"));
    '''
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1